app/views/users/_info.html.erb

    <% if userinfo != current_user %>
      <% if Relationship.exists?(follower_id: current_user.id, followed_id: userinfo.id) %>
---
SELECT  1 AS one FROM "relationships" WHERE "relationships"."follower_id" = ? AND "relationships"."followed_id" = ? LIMIT ?  [["follower_id", 1], ["followed_id", 2], ["LIMIT", 1]]