app/views/users/show.html.erb


              <td>コメント数: <%= book.book_comments.count %></td>
---
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 13]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 4]]