app/views/books/index.html.erb

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]
---
              <td><%= render'layouts/favorites', book: book %></td>
              <td>コメント数: <%= book.book_comments.count %></td>