app/views/books/index.html.erb

              <td id="favorite_btn_<%= book.id %>"> <%= render 'favorites/favorites', book: book %> </td>
              <td>コメント数: <%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"