app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "qwe"], ["body", "qwe"], ["user_id", 6], ["created_at", "2021-10-13 18:09:32.272476"], ["updated_at", "2021-10-13 18:09:32.272476"]]
---
  def create
    @book = Book.new(book_params)
    @book.save