app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @comment = current_user.book_comments.new(book_comment_params)
    @comment.book_id = @book.id
    if @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "arigatou!"], ["user_id", 11], ["book_id", 13], ["created_at", "2021-10-20 17:55:02.617984"], ["updated_at", "2021-10-20 17:55:02.617984"]]

  def destroy
    @book = Book.find(params[:book_id])
    BookComment.find_by(id: params[:id]).destroy
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]