app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "11-11"], ["body", "1111"], ["user_id", 11], ["created_at", "2021-10-16 11:11:25.858381"], ["updated_at", "2021-10-16 11:11:25.858381"]]
SELECT "books".* FROM "books"
---
  def create
    @booknew = Book.new(book_params)
    @booknew.user_id = current_user.id
    if @booknew.save
      redirect_to book_path(@booknew.id), notice:'You have created book successfully.'
    else
      @userinfo = current_user
      @books = Book.all