app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 5], ["created_at", "2021-10-23 19:02:23.194149"], ["updated_at", "2021-10-23 19:02:23.194149"]]
---
  def create
    user = User.find(params[:user_id])
    @relation = Relationship.new(follower_id: current_user.id, followed_id: user.id)
    if @relation.follower_id != @relation.followed_id
      if @relation.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."followed_id" = ? LIMIT ?  [["followed_id", "1"], ["LIMIT", 1]]
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = ? AND "relationships"."follower_id" = ? LIMIT ?  [["followed_id", 8], ["follower_id", 1], ["LIMIT", 1]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 18]]
---
  def destroy
    user = User.find(params[:user_id])
    relation = Relationship.find_by(followed_id: user.id, follower_id: current_user.id)
    relation.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def follow
    @user = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def follower
    @user = User.find(params[:user_id])