app/views/layouts/_favorites.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
  <%= link_to book_favorites_path(book), method: :delete, remote: true do %>
    ❤︎ <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]
---
  <%= link_to book_favorites_path(book), method: :post, remote: true do %>
    ♡ <%= book.favorites.count %>